# IFC_DefPsetImport2

## Description
Imports Custom Object Presets from XML, XLSX, CSV or text file.

```pascal
FUNCTION IFC_DefPsetImport2(strFilePath : STRING) : BOOLEAN;
```

```python

def vs.IFC_DefPsetImport2(strFilePath):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|strFilePath|STRING||

## Version
Availability: from Vectorworks 2023.6
## Category
* IFC